#Задача 3. Вариант 9.
#Напишите программу, которая выводит имя "Доменико Теотокопули", и
#запрашивает его псевдоним. Программа должна сцеплять две эти строки и
#выводить полученную строку, разделяя имя и псевдоним с помощью тире

#Napreenkova A. A.
#22.02.2017

print ('Персона дня - Доменико Теотокопули')
alias = input ('Под каким именем он наиболее известен?\t')
print ('Всё верно, Доменико Теотокопули -' , alias)
input ('Нажмите Enter для выхода')
