#Задача 2. Вариант 9.
#Напишите программу, которая будет выводить на экран наиболее понравившееся
#вам высказывание, автором которого является Эпиктет. Не забудьте о том, что
#автор должен быть упомянут на отдельной строке.

#Napreenkova A.A.
#16.02.2017
print ('\n\"Существует только один путь к счастью.' +
'Для этого следует перестать беспокоиться о вещах,' + 
'которые не подчинены нашей воле\"')
print ('\n\t\t\t\t\t\t\t\t\t\t\t\t"Эпиктет"')
input ('\nНажмите Enter для выхода')