#Задача 1. Вариант 16.
#Напишите программу, которая будет сообщать род деятельности и псевдоним под
#которым скрывается Грета Густафсон. После вывода информации программа
#должна дожидаться пока пользователь нажмет Enter для выхода.


#Смирнов Н.Н.
#09.03.2017

print ('Грета Густафсон более известена, как шведская и американская актриса Грета Гарбо')
input('\nНажмите Enter для выхода')