# Задача 2. Вариант 16.
# Напишите программу, которая будет выводить на экран наиболее понравившееся
# вам высказывание, автором которого является Шамиль. Не забудьте о том, что
# автор должен быть упомянут на отдельной строке.

# Смирнов Н.Н.
# 10.03.2017

print("Любить и драться надо до последней капли...")
print("\n\t\t\t\t\t\t\t\t(c) Имам Шамиль")