#Задача №4, вариант № 4.

#Напишите	программу,	которая	выводит	имя,	под	которым	скрывается	Джон 
#Гриффит	Лондон.	Дополнительно	необходимо	вывести	область	интересов 
#указанной	личности,	место	рождения,	годы	рождения	и	смерти	(если	человек
#умер),	вычислить	возраст	на	данный	момент	(или	момент	смерти).	Для	хранения 
#всех	необходимых	данных	требуется	использовать	переменные.	После	вывода 
#информации	программа	должна	дожидаться	пока	пользователь	нажмет	Enter	для 
#выхода.

#Довбыш Д.В.

print("Джек Лондон - американский писатель, социалист, общественный деятель.")
print("Место рождения: Сан-Франциско.")
print("Годы жизни: 1876-1916.")
born = 1876
died = 1916
age = (print("Возраст:",died-born, "лет."))
input("\nPress enter for exit")