#Задача №2, вариант № 4.

#Напишите	программу,	которая	будет	выводить	на	экран	наиболее	понравившееся вам	
#высказывание,	автором	которого	является	Сократ.	Не	забудьте	о	том,	что автор	
#должен	быть	упомянут	на	отдельной	строке.

#Довбыш Д.В.

print("Единственная истинная мудрость — в осознании, что мы по сути ничего не знаем.")
print("                                                                      Сократ")
input("\nPress enter for exit")