# Задача 1. Вариант 8.
# Напишите программу, которая будет сообщать род деятельности и псевдоним под
# которым скрывается Ефим Алексеевич Придворов. После вывода информации
# программа должна дожидаться пока пользователь нажмет Enter для выхода.

# Lubnin A.V.
# 04.04.2017

print("Ефим Алексеевич Придворов более известен, как русский писатель Демьян Бедный")
input("\n \n Нажмите Enter для выхода")
