# Задача 2. Вариант 8.
# Напишите программу, которая будет выводить на экран наиболее понравившееся
# вам высказывание, автором которого является Лао-Цзы. Не забудьте о том, что
# автор должен быть упомянут на отдельной строке.

# Lubnin A.V.
# 04.04.2017

print("Всё в мире растёт, цветёт и возвращается к своему корню. \n \n \t \t \t \t \t \t Лао-Цзы")
input("\n \n Нажмите Enter для выхода")
