#Задача 1 и 2. Вариант 20.

#1. Напишите программу, которая будет сообщать род деятельности и псевдоним	
#под которым скрывается	Евгений	Петрович Катаев.	
#После вывода информации программа должна дожидаться пока пользователь нажмет Enter
#для выхода.

#2. Напишите программу,	которая	будет выводить на экран наиболее	
#понравившееся вам высказывание, автором которого является Иннокентий (Борисов).	
#Не	забудьте о	том, что автор должен быть упомянут	на отдельной строке.

#Yakovleva T. V.
#02.28.2017

print ('Евгений Петрович Катаев - русский и советский писатель, журналист и сценарист. Известен под псевдонимом: Евгений Петров.')
input ('Нажмите Enter для продолжения')
print ()
print ('Происхождение на свет человека есть, по-видимому, одно из самых случайных явлений. Родиться в такое или другое время, в той или иной стране, от славных или бедных родителей, с великими или малыми способностями, — все это, и множество других обстоятельств явления человека на свет, не подлежит нимало соображению человеческому, составляет тайну бытия нашего на земле.')
print ('							Иннокентий')
input ('Нажмите Enter для продолжения')