#Задача 3. Вариант 20.

#3. Напишите программу, которая выводит имя "Мария Магдалена фон Лош", и запрашивает 
#его псевдоним. Программа должна сцеплять две эти строки и выводить полученную строку, 
#разделяя имя и псевдоним с помощью тире.

#Yakovleva T. V.
#04.04.2017

b = "Мария Магдалена фон Лош"
print ('Герой нашей программы - Мария Магдалена фон Лош!')
a = input ('По каким же именем знаем этого человека? Ваш ответ: ')
print ('Все верно:', b+' - '+a)
input ('Нажмите enter')
