#Задача 4. Вариант 20.

#4. Напишите программу, которая выводит имя, под которым скрывается Мари Фрасуа Аруэ.
#Дополнительно необходимо вывести область интересов указанной личности, место рождения,
#годы рождения исмерти (если человек умер), вычислить возраст на данный момент (или	
#момент смерти). Для хранения всех необходимых данных требуется использовать переменные.
#После вывода информации программа должна дожидаться пока пользователь нажмет Enter для
#выхода.

#Yakovleva T. V.
#04.04.2017

a = 1694
b = 1778
print ('Мари Франсуа Аруэ известен как французкий писатель и философ-просветитель Вольтер')
print ('Место рождения: Франция, Париж')
print ('Годы жизни:', a, ' - ', b )
print ('Возраст:', b-a)
input ('Нажмите enter')