#Задача 2. Вариант 13.

#Напишите программу, которая будет выводить на экран наиболее понравившееся
#вам высказывание, автором которого является Саади Ширази.
#Не забудьте о том, что автор должен быть упомянут на отдельной строке.

#Попова М.А.
#15.02.2017




print(
'''Мудрец, благодеяний грех чуждаться!
Твори добро, чтоб после не нуждаться.

                         Саади Ширази''')

input('Нажмите Enter для выхода')
