#Задача 1. Вариант 13.

#Напишите программу, которая будет сообщать род деятельности и псевдоним
#под которым скрывается Мария Луиза Полякова — Байдарова. После вывода
#информации программа должна дожидаться пока пользователь нажмет
#Enter для выхода.

#Попова М.А.
#15.02.2017

print('Мария Луиза Полякова-Байдарова более известна как французская актриса Мария Влади')
input('Нажмите Enter для выхода')
