#Задача 4. Вариант 13.

#Напишите программу, которая выводит имя, под которым скрывается Жан Батист
#Поклен. Дополнительно необходимо вывести область интересов указанной личности,
#место рождения, годы рождения и смерти (если человек умер), вычислить возраст
#на данный момент (или момент смерти). Для хранения всех необходимых данных
#требуется использовать переменные. После вывода информации программа должна
#дожидаться пока пользователь нажмет Enter для выхода.

#Попова М.А.
#15.02.2017



print('Жан Батист Поклен более известен, как французский комедиограф Жан Батист Мольер')
background=('Париж, Франция')
print('Место рождения-', background)
interes=('Театр, искусство актера')
print('Область интересов - ',interes)
godrozhdenia=('1622')
print('Год рождения-',godrozhdenia)
godsmerti=('1673')
print('Год смерти-',godsmerti)
vozrastnamomentsmerti=('51')
print('Возраст на момент смерти-',vozrastnamomentsmerti)
input('Нажмите Enter ля выхода')
