#Задача 3. Вариант 13.

#Напишите программу, которая выводит имя "Норма Бейкер", и запрашивает его
#псевдоним.Программа должна сцеплять две эти строки и выводить полученную строку,
#разделяя имя и псевдоним с помощью тире.

#Попова М.А.
#15.02.2017


print('Герой нашей сегодняшней программы - Норма Бейкер')
name=input('Под каким же именем мы знаем этого человека?')
print('Ваш ответ-', name)
print('Все верно: Норма Бейкер - ', name)
input('Нажмите Enter для выхода')
