#Задача 3. Вариант 12.

#Напишите программу, которая выводит имя "Тициано Вечеллио", и запрашивает
#его псевдоним. Программа должна сцеплять две эти строки и выводить
#полученную строку, разделяя имя и псевдоним с помощью тире.


#Ryazantsev T.O.
#01.03.2017

alias=input("Введите псевдоним: ")
print("Тициано Вечеллио-"+alias)
input("press enter")