#Задача 1. Вариант 12.

#Напишите программу, которая будет сообщать род деятельности и псевдоним под
#которым скрывается Мария Луиза Чеччарелли. После вывода информации
#программа должна дожидаться пока пользователь нажмет Enter для выхода.

#Ryazantsev T.O.
#01.03.2017

print("Мария Луиза Чеччарелли")
print("Род деятельности - Актриса")
print("Псевдоним Моника Витти")
input("press enter")
