#Задача 2. Вариант 12.

#Напишите программу, которая будет выводить на экран наиболее понравившееся
#вам высказывание, автором которого является Анвари. Не забудьте о том, что
#автор должен быть упомянут на отдельной строке.

#Ryazantsev T.O.
#01.03.2017

print("Лизоблюдов продажных не считай за людей.")
print("                     Аухад Ад-дин Анвари")
input("Press enter")