# Задача 1. Вариант 8.
# Напишите программу, которая будет сообщать род деятельности и псевдоним
# под которым скрывается Ефим Алексеевич Придворов. После вывода информации
# программа должна дожидаться пока пользователь нажмет Enter для выхода.

# Krotkova V.D.
# 13/04/2017
print('Ефим Алексеевич Придворов, более известный под псевдонимом Демьян Бедный, прославлен как русский советский писатель, поэт, публицист и общественный деятель.')


input('Нажмите Enter для выхода')
