# Задача 3. Вариант 8.
# Напишите программу, которая выводит имя "Борис Николаевич Бугаев", и  
# запрашивает его псевдоним. Программа должна сцеплять две эти строки и 
# выводить полученную строку, разделяя имя и псевдоним с помощью тире.

# Krotkova V.D.
# 13/04/2017
print('Герой нашей сегодняшней программы Борис Николаевич Бугаев')
print('Под каким же именем мы знаем этого человека?')
name = input()
print('Ваш ответ: ' + name)
print('Все верно: Борис Николаевич Бугаев - ' + name)

input('Нажмите Enter для выхода')
