# Задача 4. Вариант 8.
# Напишите программу, которая выводит имя, под которым скрывается   
# Михаил Николаевич Румянцев. Дополнительно необходимо вывести область интересов 
# указанной личности, место рождения, годы рождения и смерти (если человек умер), 
# вычислить возраст на данный момент (или момент смерти). Для хранения всех 
# необходимых данных требуется использовать переменные. После вывода информации
# программа должна дожидаться пока пользователь нажмет Enter для выхода.

# Krotkova V.D.
# 13/04/2017
print('Алексей Максимович Пешков более известен, как писатель Максим Горький')
background = ('г. Нижний Новгород')
print('Место рождения: ' , background)
year = ('1868')
print('Год рождения: ' , year)
old = ('36')
print('Возраст: ' , old)
interest = ('футбол')
print('Область интересов: ' , interest)
input('Нажмите Enter для выхода')
