# Задача 2. Вариант 8.
# Напишите программу, которая будет выводить на экран наиболее понравившееся вам 
# высказывание, автором которого является Лао-Цзы. Не забудьте о том, что автор
# должен быть упомянут на отдельной строке.

# Krotkova V.D.
# 13/04/2017
print('Если человек долго поднимался по чужой лестнице, то, прежде чем найти свою, ему нужно спуститься.')
print('\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tЛао-Цзы')


input('Нажмите Enter для выхода')
