# Задача 2. Вариант 10.
# Напишите программу, которая будет выводить на экран наиболее понравившееся вам высказывание, автором которого является Юстиниан. Не забудьте о том, что автор должен быть упомянут на отдельной строке.

# Lisyanskaya A. V.
# 14.03.2017

print("Свобода есть естественная способность каждого делать то, что ему угодно, если это не запрещено силой или правом.")
print("\t\tЮстиниан Великий")
input("\n\nНажмите Enter, чтобы выйти.")