# Задача 1. Вариант 10.
# Напишите программу, которая будет сообщать род деятельности и псевдоним под которым скрывается Ричард Дженкинс. После вывода информации программа должна дожидаться пока пользователь нажмет Enter для выхода.

# Lisynskaya A. V.
# 14.03.2017

print("Ричард Дженкинс, американский киноактер, более известен как Ричард Бертон")
input("\n\nНажмите Enter, чтобы выйти.")
