# Задача 2. Вариант 2.
# Напишите программу, которая будет выводить на экран наиболее понравившееся
# вам высказывание, автором которого является Эсхин. Не забудьте о том, что автор
# должен быть упомянут на отдельной строке.
# Vanyushin S. S.
# 2017-02-28

print("Речи благородного человека, даже если они составлены коряво и безыскусно,")
print("будут полезны для слушателей, тогда как речи мерзавца... не принесут")
print("слушателям никакой пользы. .")
print("                                                                    Эсхин")
input("Нажмите Enter для выхода")
