#Нурахмедова Камиля Наилевна
#Вариант 10
#Напишите программу, которая будет сообщать род деятельности и псевдоним под которым скрывается Ричард Дженкинс. После вывода информации программа должна дожидаться пока пользователь нажмет Enter для выхода.
#Задача1
print("Ричард Уолтер Дженкинс более известный, как Ричард Бёртон - британский актёр")
input("\n\nНажмите enter для выхода.")


