#Нурахмедова Камиля Наилевна
#Вариант 10
#Напишите программу, которая будет выводить на экран наиболее понравившееся вам высказывание, автором которого является Юстиниан. Не забудьте о том, что автор должен быть упомянут на отдельной строке.
#Задача 2
print("И не судите о том, что является лучшим и более справедливым, по большинству авторитетов: ибо мнение одного и худшего может превосходить в каком-либо вопросе многих и более высоких...")
quote="Юстиниан"
print(quote.center(120))
input("\n\nНажмите enter для выхода")
