#Нурахмедова Камиля Наилевна
#Вариант 10
#Напишите программу, которая бы при запуске случайным образом
#отображала название одного из шести континентов Земли.
#Задача 5. 

import random
x=random.choice(["Евразия", "Антарктида", "Северная Америка", "Южная Америка", "Австралия", "Африка"])
print ("Программа случайным образом отображает название одного из шести континентов Земли.")
print ("Один из шести континентов Земли это:", x)

input("\n\nНажмите Enter для выхода.")
