#Нурахмедова Камиля Наилевна
#Вариант 10
#Напишите программу, которая выводит имя "Игорь Васильевич Лотарев", и запрашивает его псевдоним. Программа должна сцеплять две эти строки и выводить полученную строку, разделяя имя и псевдоним с помощью тире.
#Задача 3
print("Герой нашей сегодняшней программы - Игорь Васильевич Лотарев")
input("\nПод каким же именем мы знаем этого человека? Ваш ответ : ")
print("Все верно: Игорь Васильевич Лотаре - Игорь Северянин")
input("\n\nНажмите enter для выхода")
