#Нурахмедова Камиля Наилевна
#Вариант 10
#Напишите программу, которая выводит имя, под которым скрывается Уильям Сидни Портер.
#Дополнительно необходимо вывести область интересов указанной личности, место рождения,
#годы рождения и смерти (если человек умер), вычислить возраст на данный момент (или момент смерти).
#Для хранения всех необходимых данных требуется использовать переменные.
#После вывода информации программа должна дожидаться пока пользователь нажмет Enter для выхода.
#Задача4

print("Уильям Сидни Портер более известный, как мастер амерканского рассказа О.Генри")
birth="США, Cеверная Королина, Гринсборо"
birthdate="1862"
age="47"
area="прозаик"
dateofdeath="1910"
print("Место рождение: ",birth)
print("Год рождения: ",birthdate)
print("Возраст на момент смерти: ",age)
print("Область интересов:",area)
print("Дата смерти:",dateofdeath)

input("\nНажмите Enter для выхода")
