# Задача 2 Вариант 5
# Напишите программу, которая будет выводить на экран наиболее понравившееся вам высказывание, автором которого является Сюнь-цзы. Не забудьте о том, что автор должен быть упомянут на отдельной строке.

# Епишина Ю.А.
# 01.03.2017

print ("Тот, кто правильно указывает на мои ошибки, — мой учитель; тот, кто правильно отмечает мои верные поступки, — мой друг; тот, кто мне льстит, — мой враг.")
print ("                                                                                                                                           Сюнь-цзы")   

input ("\n\nНажмите Enter для выхода.")