# Задача 1. Вариант 5
# Напишите программу, которая будет сообщать род деятельности и псевдоним под которым скрывается Анна Андреевна Горенко. После вывода информации программа должна ожидать пока пользователь нажмет Enter для выхода

# Епишина Ю.А.
# 01.03.2017




print ("Анна Андреевна Горенко - известная русская поэтесса, переводчица и литературовед")
input ("\n\nНажмите Enter для выхода.")