# Задача 4 Вариант 5
# Напишите программу, которая выводит имя, под которым скрывается Фредерик Аустерлиц. Дополнительно необходимо вывести область интересов указанной личности, место рождения, годы рождения и смерти (если человек умер), вычислить возраст на данный момент (или момент смерти). Для хранения всех необходимых данных требуется использовать переменные. После вывода информации программа должна дожидаться пока пользователь нажмет Enter для выхода

# Епишина Ю.А.
# 01.03.2017

print ("Фредерик Аустерлиц известен миру больше как американский актер Фред Астер")
print ("Год рождения 1899")
print ("Год смерти 1987")
a=1899
b=1987
c=b-a
print ("Таким образом, Фред Астер жил ", c, "лет")
print ("Область деятельности: кино")

input ("\n\nНажмите Enter для выхода.")