# Задача 3 Вариант 5
# Напишите программу, которая выводит имя "Жан Батист Поклен", и запрашивает его псевдоним. Программа должна сцеплять эти две строки и выводить полученную строку, разделяя имя и псевдоним с помощью тире

# Епишина Ю.А.
# 01.03.2017

print ("Герой нашей сегодняшней программы - Жан Батист Поклен")
print ("Под каким же псевдонимом он нам известен?")
name = input ("Ваш ответ:")
print ("Таким образом, Жан Батист Поклен - ", name)

input ("\n\nНажмите Enter для выхода.")