# Задача 1. Вариант 12.
# Напишите программу, которая будет сообщать род деятельности и псевдоним под которым скрывается Мария Луиза Чеччарелли. После вывода информации программа должна дожидаться пока пользователь нажмет Enter для выхода.

#Степанова Н. 
#06.03.2017
print('Мария Луиза Чеччарелли, род деятельности актриса, псевдоним Моники Витти')
input('Нажмите enter для выхода')