# Задача 2. Вариант 12.
#Напишите программу, которая будет выводить на экран наиболее понравившееся вам высказывание, автором которого является Анвари. Не забудьте о том, что автор должен быть упомянут на отдельной строке.

#Степанова Н. C.
#06.03.2017
print ('Друг — зеркало для друга, нет зеркала светлей!')
print (' \t\t\t\t\t\t\t\t\t\t\t\t\t\tАнвари ')
input (' Нажмите  Enter для выхода ')
