#Задача 2. Вариант 17.
#Напишите программу, которая будет выводить на экран наиболее понравившееся 
#вам высказывание, автором которого является Самарканди. Не забудьте о том, 
#что автор должен быть упомянут на отдельной строке.

#Feokritova M.V.
#14.03.2017
 
print('"Знай, у того, кто не правдив в любви, Притворство с лицемерием в крови"')
print('\t\t\t\t\t\t\tАс-Cамарканди\n')
input('Press Enter')
