#Задача 1. Вариант 17.
#Напишите программу, которая будет сообщать род деятельности и псевдоним 
#под которым скрывается Алексей Максимович Пешков. После вывода информации 
#программа должна дожидаться пока пользователь нажмет Enter для выхода.

#Feokritova M.V.
#14.03.2017

print('Алексей Максимович Пешков более известен, как русский писатель Максим Горький')
input('\nPress Enter')
