# Задача 3. Вариант 8.
# Напишите программу, которая выводит имя "Борис Николаевич Бугаев", и запрашивает его псевдоним. Программа должна сцеплять две эти строки и выводить полученную строку, разделяя имя и псевдоним с помощью тире.

# Nikolaev N.A.
# 01.04.2016

print("Герой нашей сегодняшней программы - Борис Николаевич Бугаев")
name=input("Под каким же именем мы знаем этого человека? Ваш ответ: ")
print("Всё верно: Борис Николаевич Бугаев - ", name)

input("\n\nНажмите Enter для выхода.")
