# Задача 2. Вариант 8.
# Напишите программу, которая будет выводить на экран наиболее понравившееся вам высказывание, автором которого является Лао-Цзы. Не забудьте о том, что автор должен быть упомянут на отдельной строке.

# Nikolaev N.A.
# 01.04.2016

print("""
Голос истины противен слуху.
                                           Лао-Цзы""")

input("\n\nНажмите Enter для выхода.")
