# Задача 1. Вариант 8.
# Напишите программу, которая будет сообщать род деятельности и псевдоним под которым скрывается Ефим Алексеевич Придворов. После вывода информации программа должна дожидаться пока пользователь нажмет Enter для выхода.

# Nikolaev N.A.
# 01.04.2016

print("Ефим Алексеевич Придворов - русский писатель. Псевдоним: Демьян Бедный")

input("\n\nНажмите Enter для выхода.")
