# Задача 4. Вариант 8.
# Напишите программу, которая выводит имя, под которым скрывается Алексей Максимович Пешков. Дополнительно необходимо вывести область интересов указанной личности, место рождения, годы рождения и смерти (если человек умер), вычислить возраст на данный момент (или момент смерти). Для хранения всех необходимых данных требуется использовать переменные. После вывода информации программа должна дожидаться пока пользователь нажмет Enter для выхода.

# Nikolaev N.A.
# 01.04.2016

print("Алексей Максимович Пешков более известен, как российский писатель Максим Горький")
birth="Нижний Новгород, Россия"
date="1868"
age="68"
death="1936"
area="Литература"
print("Место рождения: ", birth)
print("Год рождения: ", date)
print("Возраст: ", age)
print("Дата смерти: ", death)
print("Область интересов: ", area)

input("\n\nНажмите Enter для выхода.")
