#Задача 1. Вариант 9.
#Напишите программу, которая будет сообщать род деятельности и псевдоним под
#которым скрывается Борис Николаевич Бугаев. После вывода информации
#программа должна дожидаться пока пользователь нажмет Enter для выхода.

#Napreenkova A. A.
#16.02.2017

print ('Борис Николаевич Бугаев более известен, как русский писатель Андрей Белый')
input('\nНажмите Enter для выхода')