#Задача 4. Вариант 9.
#Напишите программу, которая выводит имя, под которым скрывается Михаил
#Николаевич Румянцев. Дополнительно необходимо вывести область интересов
#указанной личности, место рождения, годы рождения и смерти (если человек
#умер), вычислить возраст на данный момент (или момент смерти). Для хранения
#всех необходимых данных требуется использовать переменные. После вывода
#информации программа должна дожидаться пока пользователь нажмет Enter для
#выхода.

#Napreenkova A. A.
#15.03.2017

print ('Михаил Николаевич Румянцев более известен, как клоун Карандаш')
bplace = 'Санкт-Петербург'
bdate = '27 ноября 1901'
ddate = '31 марта 1983'
interest = 'Цирк'
print ('\nМесто рождения:', bplace)
print ('\nДата рождения', bdate)
print ('\nДата смерти:', ddate)
print ('\nОбласть интересов:', interest)

input ('\nВведите Enter для завершения')