# Задача 2. Вариант 10.
# Напишите программу, которая будет выводить на экран наиболее понравившееся вам высказывание,
# автором которого является Юстиниан. Не забудьте о том, что автор должен быть упомянут на отдельной строке.

# Rechkalov A.S.
# 28.03.17

print("Священная вещь не подлежит оценке.")
print("\n\t\t\t Юстиниан")
input("\n\nНажмите Enter, чтобый выйти.")
