# Задача 3. Вариант 10.
# Напишите	программу,	которая	выводит	имя	"Игорь	Васильевич	Лотарев",	и запрашивает	его	псевдоним.
# Программа	должна	сцеплятьдве	эти	строки	и выводить	полученную	строку,
# разделяя	имя	и	псевдоним	с	помощью	тире.

# Rechkalov A.S.
# 28.03.17

print("Герой нашей сегодняшней программы - Игорь Васильевич Лотарев")
psevdo = input("Под каким же именем мы знаем этого человека? Ваш ответ: ")
print("Все верно: Игорь Васильевич Лотарев -", psevdo)
input("\n\nНажмите Enter, чтобы выйти.")
