#	Задача	1. Вариант 10.
#       Напишите программу, которая будет сообщать род деятельности и	псевдоним   под которым	скрывается  Ричард	Дженкинс.
#       После	вывода	информации	программа должна	дожидаться	пока	пользователь	нажмет	Enter	для	выхода. 

#	Rechkalov A.S.
#	28.03.2017

print("Ричард Дженкинс более известен, как американский киноактёр Бертон.")
input("\n\nНажмите Enter для выхода")
