# Задача 1. Вариант 15.
# Напишите программу, которая будет сообщать род деятельности и псевдоним под
# которым скрывается Аркадий Петрович Голиков. После вывода информации
# программа должна дожидаться пока пользователь нажмет Enter для выхода.

# Сухоруков Д. С.

# 28.02.17
print("Аркадий Петрович Голиков - русский, советский детский писатель, киносценарист.")
print("Известен под псевдонимом псевдонимом Гайдар.")
input("\nНажмите Enter для выхода")

