# Задача 2. Вариант 15.
# Напишите программу, которая будет выводить на экран наиболее понравившееся
# вам высказывание, автором которого является Плутарх. Не забудьте о том, что
# автор должен быть упомянут на отдельной строке

# Сухоруков Д. С.

# 28.02.17
print("Желание мешает нам пользоваться тем, что мы имеем.")
print("\t\t\t\t\t\tПлутарх")
input("\n\nНажмите Enter для выхода")

