# Задача №1 v8
# Воробьев Илья Андреевич ИНБ-2016-1
# Напишите программу, которая будет сообщать род деятельности и псевдоним под которым скрывается Ефим Алексеевич Придворов

print("Ефим Алексеевич Придворов, был известен как русский советский писатель, поэт, публицист и общественный деятеь, псевдоним: Демьян Бедный.")

end = input("\nНажмите Enter для выхода")