# зачада №2 v8
# Воробьев Илья Андреевич ИНБ-2016-1
# Напишите программу, которая будет выводить на экран наиболее понравившееся вам высказывание, автором которого является Лао-Цзы. Не забудьте о том, что автор дожен быть на отдельной строке

print("Когда народ много знает, им тредно управлять.")
print("\t\t\t\t\t\t\t\t\t\t\tЛао-Цзы")

end = input("Нажмите Enter для выхода.")