# Задача №4 м8
# Воробьев Илья Андреевич ИНБ-2016-1
# Напишите программу которая выводит имя,
# под которым скрывается Алексей Максимович Пешков.
# Дополнительно необходимо ввести область интересов указанной личности,
# место рождения, годы рождения и смерти (если человек умер), вычислить возраст на данный момент (или момент смерти).
# Для хранения всех необходимых данных требуется использовать переменные

print("Ллексей Максимович Пешков, более известен как Макси голькоий.")

m = "Нижний Новгород"
g = 1868
oo = "Писатель"
d = 2017
l = d - g

print("Место рождения:", m)
print("Год рождения:", g)
print("Возраст", l)
print("Область интересов", oo)

c = input("\nНажмите Enter для выхода")
