#Задача 1. Вариант 7.
#Напишите программу, которая будет сообщать род деятельности и псевдоним под которым скрывается Эдуард Георгиевич Зюбин. После вывода информации программа должна дожидаться пока пользователь нажмет Enter для выхода.
#Кунгурцева А.В.
#15.03.2017
#
#Программа сообщает род деятельности и псевдоним человека
print ("Задача 1")
print ("Эдуард Георгиевич Зюбин - писатель, известный под псевдонимом \"Бедный Демьян\"")
input ("\nНажмите Enter для выхода")