#Задача 2. Вариант 7.
#Напишите программу, которая будет выводить на экран наиболее понравившееся вам высказывание, автором которого является Стендаль. Не забудьте о том, что автор должен быть упомянут на отдельной строке.
#Кунгурцева А.В.
#15.03.2017
print ("Задача 2")
print ("\nВ мире чувства есть лишь один закон — составить счастье того, кого любишь.")
print ("\n\t\t\t\t\t\t\t\t\tСтендаль")
input ("")
