# Задача 2. Вариант 23.
# Напишите программу, которая будет выводить на экран наиболее понравившееся вам высказывание,
# автором которого является Наполеон Бонапарт. Не забудьте о том, что автор должен быть упомянут на отдельной строке.

# Sergeeva L.A.
# 11.04.17

print("От возвышенного до смешного один только шаг.")
print("\n\t\t\t Наполеон Бонапарт")
input("\n\nНажмите Enter, чтобый выйти.")