# Задача 6. Вариант 23.
# Создайте игру, в которой компьютер загадывает название одного из семи дней недели, а игрок должен его угадать.

# Sergeeva L.A.
# 13.04.2017

import random
secret = random.choice(["Понедельник", "Вторник", "Среда", "Четверг", "Пятница", "Суббота", "Воскресенье"])

print("Программа случайным образом загадывает название одного из семи дней недели. Вам необходимо отгадать какой из дней недели загадан.")
luck = input("Ваше предположение: ")
if secret.upper() == luck.upper():
	print("Вы угадали! Это был ", secret)
else:
	print("Вы не угадали! Был загадан: ", secret)
input("\n \n Нажмите Enter для выхода")