# Задача 7. Вариант 23.
# Разработайте систему начисления очков для задачи 6, в соответствии с которой
# игрок получал бы большее количество баллов за меньшее количество попыток
# угадать.

# Sergeeva L.A.
# 13.04.2017

import random
xp = 2356
secret = random.choice(["Понедельник", "Вторник", "Среда", "Четверг", "Пятница", "Суббота", "Воскресенье"])
print("Программа случайным образом загадывает название одного из семи дней недели. Вам необходимо отгадать какой из дней загадан.")
while 0<1:
	luck = input("Ваше предположение: ")
	if secret.upper() == luck.upper():
		print("Вы угадали! Это был ", secret, ". Получено очков: ", int(xp))
		break
	elif xp<506:
		print("Попытки закончились, очки не начислены!")
		break
	else:		
		print("Вы не угадали! Попробуйте еще разок")
		xp*=.71
		
input("\n\n Нажмите Enter для выхода")