# Задача1.вариант 23. 
#Напишите программу, которая будет сообщать род деятельности и псевдоним под которым скрывается Конрад Джозеф Английский писатель Юзеф Теодор Конрад Коженевский.
#После вывода информации программа должна дожидаться пока пользователь нажмет Enter для выхода.

#Sergeeva L.A.
#11.04.2017

print ("Конрад Джозеф Английский-писатель")
print ("который известен под псевдонимом Юзеф Теодор Конрад Коженевский")
input ("\nPress Enter to exit from program...")



