# Задача 3. Вариант 23.
# Напишите программу, которая выводит имя "София Шиколоне", и запрашивает его псевдоним. 
# Программа должна сцеплять две эти строки и выводить полученную строку, 
# разделяя	имя	и	псевдоним	с	помощью	тире.

# Sergeeva L.A.
# 13.04.17

print("Герой нашей сегодняшней программы - София Шиколоне")
psevdo = input("Под каким же именем мы знаем этого человека? Ваш ответ: ")
print("Все верно: София Шиколоне -", psevdo)
input("\n\nНажмите Enter, чтобы выйти.")