# Задание 5. Вариант 23.
#Напишите программу, которая бы при запуске случайным образом отображала имя одной из трех официальных жен Зевса.

# Sergeeva L.A.

# 13.04.17

import random

print("Программа случайным образом отображает имя одной из трех официальных жен Зевса \n\n", random.choice(["Метида", "Фемида","Гера"]))
input("\n \n Нажмите Enter для выхода")