# Задача 3. Вариант 9.
# Напишите программу, которая выводит имя "Доменико Теотокопули", и запрашивает его псевдоним. Программа должна сцеплять две эти строки и выводить полученную строку, разделяя имя и псевдоним с помощью тире.

# Lungu R.U.
# 11.04.2017

name = "Доменико Теотокопули"
print("Герой нашей сегоднящней программы - " + name)
alias = input("Под каким же именем мы знаем этого человека? Ваш ответ: ")

print("Все верно: " + name + " - " + alias)

input("\n\nНажмите Enter для выхода.")
