# Задача 3. Вариант 9.
# Напишите программу, которая выводит имя "Доменико Теотокопули", и запрашивает
# его псевдоним. Программа должна сцеплять две эти строки и выводить
# полученную строку, разделяя имя и псевдоним с помощью тире.

# Ignateva J.S
# 26.03.2017

name= (input ('Какое произвище у Доменико Теотокопули?'))
print ('Правильно!Доменико Теотокопули -',name)
input ('Нажмите Enter для выхода')
