# Задача 1. Вариант 9.
# Напишите программу, которая будет сообщать род деятельности и псевдоним
# под которым скрывается Борис Николаевич Бугаев. После вывода информации
# программа должна дожидаться пока пользователь нажмет Enter для выхода.

# Ignateva J.S.
# 26.03.2017

print ('Борис Николаевич Бугаев более известен, как писатель Андрей Белый.')
input('Нажмите Enter для выхода.')
