# Задача 2. Вариант 9.
# Напишите программу, которая будет выводить на экран наиболее понравившееся
# вам высказывание, автором которого является Эпиктет. Не забудьте о том, что
# автор должен быть упомянут на отдельной строке.

# Ignateva J.S
# 26.03.2017

print ('Нет никого, кто, любя деньги, удовольствия и славу, любил бы и людей: их любит лишь тот, кто любит добродетель.')
print ('\t\t\t\t\t Эпиктет')
input ('Нажмите Enter для выхода')
