# Задача 4. Вариант 13
# Напишите программу, которая выводит имя, под которым скрывается Жан Батист Поклен. Дополнительно необходимо вывести область интересов указанной личности, место рождения, годы рождения и смерти (если человек умер), вычислить возраст на данный момент (или момент смерти). Для хранения всех необходимых данных требуется использовать переменные. После вывода информации программа должна дожидаться пока пользователь нажмет Enter для выхода.
# Казанцев Максим
# 03.03.2017
print("Жан Батист Поклен более известен, как французский французский комедиограф.")
print("Место рождения: Париж, Франция")
print("Год рождения: 1622")
print("Год смерти: 1673")
print("Область интересов: юриспруденция \n\n")
input("Введите Enter для выхода")
