# Задача 2. Вариант 13
# Напишите программу, которая будет выводить на экран наиболее понравившееся вам высказывание, автором которого является Саади Ширази. Не забудьте о том, что автор должен быть упомянут на отдельной строке.
# Казанцев Максим
# 01.03.2017
print("Покуда человек не говорит, Неведом дар его, порок сокрыт.\n")
