# Задача 3. Вариант 13
# Напишите программу, которая выводит имя "Норма Бейкер", и запрашивает его псевдоним. Программа должна сцеплять две эти строки и выводить полученную строку, разделяя имя и псевдоним с помощью тире.
# Казанцев Максим
# 01.03.2017

print("Сегодня у нас в телешоу - Норма Бейкер")
nickname = input("Под каким же именем мы знаем её? Ваш ответ: ")

print("Все правильно: Норма Бейкер - ", nickname, "\n\n")
input("Введите Enter для выхода")
