# Задача 1. Вариант 13
# Напишите программу, которая будет сообщать род деятельности и псевдоним под которым скрывается Мария Луиза Полякова. После вывода информации программа должна дожидаться пока пользователь нажмет Enter для выхода.

# Казанцев Максим
# 01.03.2017

print("Мария Луиза Полякова был более известен как детский писатель и журналист Мария Луиза Полякова\n\n")
("Введите Enter для выхода")
