# задача №2 2 вариант
#  Напишите программу, которая будет выводить на экран наиболее понравившееся
# вам высказывание, автором которого является Эсхин. Не забудьте о том, что автор
# должен быть упомянут на отдельной строке.
# Выполнил Губанов Д. Д
# 01/03/17
print("Опьянение показывает душу человека, как зеркало отражает его тело.")
print("\t\t\t\t\t\t\t\tЭсхин  ")
input("\n\nНажмите Enter для выхода.")