# задача №1 2 вариант
#  Напишите программу, которая будет сообщать род деятельности и псевдоним под
# которым скрывается Мартин Андерсен. После вывода информации программа
# должна дожидаться пока пользователь нажмет Enter для выхода.
# Выполнил Губанов Д. Д
# 14/03/17
print("Мартин Андерсен более известен, как датский писатель  Мартин Андерсен-Некс.")
input("\n\nНажмите Enter для выхода.")