# задача №4 2 вариант
#  Напишите программу, которая выводит имя, под которым скрывается Михаил
#Евграфович Салтыков. Дополнительно необходимо вывести область интересов
#указанной личности, место рождения, годы рождения и смерти (если человек
#умер), вычислить возраст на данный момент (или момент смерти). Для хранения
#всех необходимых данных требуется использовать переменные. После вывода
#информации программа должна дожидаться пока пользователь нажмет Enter для
#выхода.

# Выполнил Губанов Д. Д
# 15/03/17
print("Михаил Евграфович Салтыков более известен, как"\
+" русский писатель Салтыков-Щедрин")
print("Место рождения:"\
+" Спас-Угол")
print("Год рождения:"\
+" 1826")
a=1826
print("Дата смерти:"\
+" 1889")
b = 1889
c = b-a
print("Возраст:", c)
input("\n\nНажмите Enter для выхода.")