#Задача 1. Вариант 16.
#Напишите программу, которая будет сообщать род деятельности и псевдоним под
#которым скрывается Грета Густафсон. После вывода информации программа
#должна дожидаться пока пользователь нажмет Enter для выхода.

#Feokritova A. V.
#13.03.2017

print ('Грета Густафсон известная шведская и американская актриса под псевдонимом Гарбо')
input ('/n/nPress Enter')