# coding: utf-8

#Задача 1. Вариант 15 

#Напишите программу, которая будет сообщать род деятельности 
#и псевдоним под которым скрывается Аркадий Петрович Голиков. 
#После вывода информации программа должна дожидаться пока пользователь 
#нажмет Enter для выхода.

#Токмаков А.В
#28.02.2017

print("Arkady Petrovich Golikov.He is known as a writer.He had the nickname 'Gaydar'")
input("Press Enter")