# coding: utf-8

#Задача 3. Вариант 15 

#Напишите программу, которая выводит имя "Лариса Петровна Косач-Квитка",
#и запрашивает его псевдоним. Программа должна сцеплять две эти строки 
#и выводить полученную строку, разделяя имя и псевдоним с помощью тире.

#Токмаков А.В
#28.02.2017

print("Larysa Kosach-Kvitka")
alias=input("Enter alias: ")
print("Larysa Kosach-Kvitka-"+alias)
input("Press Enter")