# coding: utf-8

#Задача 2. Вариант 15 

#Напишите программу, которая будет выводить на экран наиболее 
#понравившееся вам высказывание, автором которого является Плутарх. 
#Не забудьте о том, что автор должен быть упомянут на отдельной строке.

#Токмаков А.В
#28.02.2017

print("Learn to listen - and you will be able to benefit even from those who talk badly")
print("                       Plutarch")
input("Press Enter")
