#Задача 1 Вариант 5
#Напишите программу, которая будет сообщать род деятельности и псевдоним под
#которым скрывается Саид-Мурадзола Садриддин. После вывода информации
#программа должна дожидаться пока пользователь нажмет Enter для выхода
#Karmitsky K.S
# 09.03.2017
print("Саид-Мурадзола Садриддин Футболист")
print("Его псевдоним - непобедимый")
input("Нажмите enter чтобы выйти")