# Задача 1. Вариант 2.
# Напишите программу, которая будет сообщать род деятельности и псевдоним под
# которым скрывается Мартин Андерсен. После вывода информации программа
# должна дожидаться пока пользователь нажмет Enter для выхода.
# Vanyushin S. S.
# 2017-02-28

print("Мартин Андерсен имел псевдоним Андерсен-Нексё.")
print("Род деятельности - писатель, прозаик, журналист")
input("Нажмите Enter для выхода")
