# Задача 2. Вариант 16.
# Напишите программу, которая будет выводить на экран наиболее понравившееся вам высказывание, автором которого является Шамиль. Не забудьте о том, что автор должен быть упомянут на отдельной строке.
#Udovenko A. Y.
# 28.02.2017
print ("\n\tЛюбить и драться надо до последней капли... \n\t\t\t\tИмам Шамиль")
input ("Нажмите Enter, чтобы выйти.")
