# Задача 1. Вариант 16.
# Напишите программу, которая будет сообщать род деятельности и псевдоним под которым скрывается Грета Густафсон. После вывода информации программа должна дожидаться пока пользователь нажмет Enter для выхода.
# Udovenko A. Y.
# 28.02.2017
print ("\nПсевдоним американской киноактрисы Греты Ловисы Густафсон - Гарбо.\n")
input ("Нажмите Enter, чтобы выйти")
