#Напишите программу, которая будет сообщать род деятельности и псевдоним под
#которым скрывается Аркадий Петрович Голиков. После вывода информации
#программа должна дожидаться пока пользователь нажмет Enter для выхода.
print("Саид-Мурадзола Садриддин - писатель- психолог, более известен как Давлатов Саидмурад Раджабович.")
input("n/nНажмите Enter")