# Задача 3. Вариант 6.
#Напишите программу, которая выводит имя "Самюэл Ленгхорн Клеменс", и запрашивает его псевдоним. Программа должна сцеплять две эти строки и выводить полученную строку, разделяя имя и псевдоним с помощью тире.
#Псевдоним - Марк Твен

#Bogdanova A.

name="Самюэл Ленгхорн Клеменс"
print("Сегодня у нас в гостях - " + name)
nickname=input("Мы знаем этого человека под именем: ")

print("Правильно: " + name + " - " + nickname)

input("\n\nНажмите Enter, чтобы выйти.")
