#Задача 1. Вариант 6.
#Напишите программу, которая будет сообщать род деятельности и псевдоним под которым скрывается Йоханнес Бруфельдт. После вывода информации программа должна дожидаться пока пользователь нажмет Enter для выхода.
#Bogdanova A.

print("Юхани Ахо-финский писатель, журналист, переводчик. Настоящее имя писателя — Йоханнес Бруфельдт.")

input("\n\nНажмите Enter, чтобы выйти.")
