#Задача №3, вариант № 4.

#Напишите	программу,	которая	выводит	имя	"Уильям	Сидни	Портер",	и 
#запрашивает	его	псевдоним.	Программа	должна	сцеплять	две	эти	строки	и 
#выводить	полученную	строку,	разделяя	имя	и	псевдоним	с	помощью	тире.

#Довбыш Д.В.

Псевдоним = input("Введите псевдоним: ")
print("Уильям Сидни Портер - " + Псевдоним)
input("\nPress enter for exit")

