#Задача №1, вариант № 4.

#Напишите	программу,	которая	будет	сообщать	род	деятельности	
#и	псевдоним	под которым	скрывается	Фредерик	Аустерлиц.	
#После	вывода	информации	программа должна	дожидаться	пока	пользователь	
#нажмет	Enter	для	выхода.

#Довбыш Д.В.

print("Фредерик Аустерлиц. Род деятельности - американский актёр, танцор, хореограф и певец. Его псевдоним - Фред Астер.")
input("\nPress enter for exit")