# Задача 2. Вариант 8.
# Напишите программу, которая будет выводить на экран наиболее понравившееся вам высказывание, автором которого является Лао-Цзы. Не забудьте о том, что автор должен быть упомянут на отдельной строке.
# Ermachenkov E. M.
# 28.03.2017

print('Нет беды тяжелее незнания удовлетворения.\n\t\t\t\tЛао-Цзы')
input('\n\nНажмите Enter для выхода')
