# Задача 1. Вариант 8.
# Напишите программу, которая будет сообщать род деятельности и псевдоним под которым скрывается Ефим Алексеевич Придворов. После вывода информации программа должна дожидаться пока пользователь нажмет Enter для выхода.

# Ermachenkov E. M.
# 28.03.2017

print('Ефим Алексеевич Придворов - русский советский писатель, поэт, публицист и общественный деятель, псевдоним - Демьян Бедный.')
input('\n\nНажмите Enter для выхода.')
