#Шпилёва М.А. Задача 2 Вариант 19
#Напишите программу, которая будет выводить на экран наиболее понравившееся
#вам высказывание, автором которого является Эсхил. Не забудьте о том, что
#автор должен быть упомянут на отдельной строке.

#Шпилёва Маргарита

print('Хоть плохо мне, но это не причина, чтоб доставлять страдания другим.\n')
print('\t\t\t\tЭсхил')
input ('Нажмите Enter для выхода')
