#Шпилёва Маргарита Александровна Задача 1 Вариант 19
#Напишите программу, которая будет сообщать род деятельности и псевдоним под
#которым скрывается Илья Арнольдович Файзильберг. После вывода информации
#программа должна дожидаться пока пользователь нажмет Enter для выхода.

#Шпилёва Маргарита

print('Илья Арнольдович Файзильберг более известен, как монтажник Поль')
input ('Нажмите Enter для выхода')
