#Шпилёва М.А. Задача 4 Вариант 19
#Напишите программу, которая выводит имя, под которым скрывается Ричард
#Дженкинс. Дополнительно необходимо вывести область интересов указанной
#личности, место рождения, годы рождения и смерти (если человек умер),
#вычислить возраст на данный момент (или момент смерти). Для хранения всех
#необходимых данных требуется использовать переменные. После вывода
#информации программа должна дожидаться пока пользователь нажмет Enter для выхода.

#Шпилёва Маргарита
interest= 'американский киноактёр'
print('Ричард Дженкинс более известен, как ', interest)
PlaceOfBirth='Де-Калб, Иллинойс, США'
print('Место рождения: ', PlaceOfBirth)
YearOfBirth=1947
print('Год рождения: ', YearOfBirth)
Age=2017-YearOfBirth
print('Возраст: ', Age)
input ('Нажмите Enter для выхода')