#Задача 1. Вариант 1.
#Напишите программу, которая будет сообщать род деятельности и псевдоним
#под которым скрывается Саид-Мурадзола Саидриддин. После вывода информации
#программа должна дожидаться пока пользователь нажмет Enter для выхода.
#Болатукаев Алим.З.
#21.02.2017.
print("Саид-Мурадзола Садриддин-Айни,Таджикский писатель и ученый")
input("\n\nНажмите Enter чтобы закрыть программу")
