# Задача 4. Вариант 13. 
# Напишите программу, которая выводит имя, под которым скрывается Жан Батист Поклен. 
#Дополнительно необходимо вывести область интересов указанной личности, место рождения, 
#годы рождения и смерти (если человек умер), вычислить возраст на данный момент (или
#момент смерти). Для хранения всех необходимых данных требуется использовать переменные
#После вывода информации программа должна дожидаться пока пользователь нажмет Enter 
#для выхода


# Болатукаев.А.З
# 28.02.2017



print ('Иво Ливи Поклен француский певец-шансоньер и актер')
print ('Область интересов: театр, киноиндустрия, музыка')
print ('Место рождения: Монсуммано-Терме, Тоскана')
print ('Годы жизни: 13.10.1921-19.11.1991 \a')
print ('Возраст: 70 год')
input ('\n\n\nнажмет Enter для выхода.')
