#Напишите программу, которая выводит имя "Иво Ливи", и
#запрашивает его псевдоним. Программа должна сцеплять две эти строки и
#выводить полученную строку, разделяя имя и псевдоним с помощью тире.
#Болатукаев.А.З.
#14.03.2017

print('Герой нашей сегодняшней программы - Иво Ливи')
name = input ('Какой его псевдоним: ')
print('\aПод каким же именем мы знаем этого человека. Ваш ответ: ',name)
print('Все верно Иво Ливи - ',name)
input('\n\nНажмите Enter, чтобы продолжить')
