#Задача 2. Вариант 1.
#Напишите программу, которая будет выводить на экран наиболее понравившееся вам высказывание,
#автором которого является Еврипид.
#Не забудьте о том, что автор должен быть упомянут на отдельной строке.
#Болатукаев Алим.З.
#21.02.2017.
print("“Кто знает, может быть, жить — это значит умереть, а умереть — жить.”")
print("-Еврипид.")
input("\n\nНажмите Enter чтобы закрыть программу")
