# Задача 2. Вариант 9
# Напишите программу, которая будет выводить на экран наиболее понравившееся вам высказывание, автором которого является Эпиктет. Не забудьте о том, что автор должен быть упомянут на отдельной строке.

# Popova Y.S.
# 05.04.2017

print('"Существует только один путь к счатью - перестать беспокоиться о вещах, '
      + 'которые не подвластны нашей воле"')
print("\n\t\t\t\t\t\tЭпиктет")
input("\nНажмите Enter, чтобы выйти")
