# Задача 1. Вариант 9
# Напишиете программу, которая будет сообщать род деятельности и псевдоним, под которым скрывается Борис Николаевич Бугаев. После вывода информации программа должна дожидаться пока пользователь нажмет Enter для выхода.

# Popova Y.S.
# 05.04.2017

print("Борис Николаевич Бугаев более известен под псевдонимом Андрей Белый.")
input("\nНажмите Enter, чтобы выйти")
