#-*-coding: cp1251-*-
# Задача 1 Вариант 7
# Напишите	программу,	которая	будет	сообщать	род	деятельности	и	псевдоним	под которым	скрывается	Эдуард	Георгиевич	Зюбин.	После	вывода	информации программа	должна	дожидаться	пока	пользователь	нажмет	Enter	для	выхода.
# Kochetkova I.A
# 02.04.2017
print("Эдуард Георгиевич Зюбин более известен, как Багрицкий Эдуард.")
input("\n\nНажмите Enter для выхода.")