#-*- coding: cp1251-*-
# Задача 2 Вариант 7
# Напишите	программу,	которая	будет	выводить	на	экран	наиболее	понравившееся вам	высказывание,	автором	которого	является	Стендаль.	Не	забудьте	о	том,	что автор	должен	быть	упомянут	на	отдельной	строке.
# Kochetkova I.A.
#02.04.2017
print("Извинить Бога может только то, что его нет.")
print("\n\t\t\t\t\tСтендаль")
input("\n\nНажмите Enter для выхода")