#Задача 2. Вариант 16.
#Напишите программу, которая будет выводить на экран наиболее понравившееся
#вам высказывание, автором которого является Шамиль. Не забудьте о том, что
#автор должен быть упомянут на отдельной строке.

#Feokritova A. V.
#13.03.2017

print('Боишься - не говори, сказал - не бойся')
print('\t\t\tИмам Шамиль')
input('Press Enter')