# Задача 1. Вариант 8.
# Напишите программу, которая будет сообщать род деятельности и псевдоним под которым скрывается Ефим Алексеевич Придворов.
# После вывода информации программа должна дожидаться пока пользователь нажмет Enter для выхода.

# Zenkov A.S.
# 13.03.2017

print("Ефим Алексеевич Придворов известен как Демьян Бедный.")

input("\n\nНажмите Enter для выхода.")