# Задача 2. Вариант 8.
# Напишите программу, которая будет выводить на экран наиболее понравившееся вам высказывание, автором которого является Лао-Цзы.
# Не забудьте о том, что автор должен быть упомянут на отдельной строке.

# Zenkov A.S.
# 13.03.2017

print("Знающий людей разумен, а знающий себя самого прозорлив.\n\t\t\t\t\tЛао Цзы.")

input("\nНажмите ENTER для выхода из программы.")