# Задача 1. Вариант 13.
# Напишите программу, которая будет сообщать род деятельности и 
# псевдоним под которым скрывается Мария Луиза Полякова — Байдарова. 
# После вывода информации программа должна дожидаться пока пользователь
# нажмет Enter для выхода.

# Salov A. S.
# 13.03.2017

print ('Мария Луиза Полякова-Байдарова является ни кем другим, как французской актрисой, известной под псевданимом Марина Влади.')
input('\nНажмите Enter для выхода')