# Задача 2. Вариант 13.
# Напишите программу, которая будет выводить на экран наиболее понравившееся вам высказывание,
# автором которого является Саади Ширази. Не забудьте о том, что автор должен быть упомянут на отдельной строке.

# Salov A. S.
# 13.03.2017

print ('Кто с дерзким мягок, тот не разумеет. Что дерзкий только пуще обнаглеет.\n\n\t\t\t\t\t\tСаади Ширази')
input()