#Задача 2. Вариант 18.
#Напишите программу, которая будет выводить на экран наиболее понравившееся 
#вам высказывание, автором которого является Вольтер. Не забудьте о том, 
#что автор должен быть упомянут на отдельной строке.

#Shamugija L.G.
#13.03.2017

print("Затянувшаяся дискуссия означает, что обе стороны не правы.")
print("\n\t\t\t\t\t\tВольтер")
input("\nPress Enter")
