#Задача 1. Вариант 18.
#Напишите программу, которая будет сообщать род деятельности и псевдоним 
#под которым скрывается Мария Магдалена фон Лош. После вывода информации 
#программа должна дожидаться пока пользователь нажмет Enter для выхода.

#Shamugija L.G.
#13.03.2017

print("Мария Магдалена фон Лош - актриса более известна, как Марлен Дитрих")
input("\nPress Enter")
