# Задача 4. Вариант 11

# Напишите программу, которая выводит имя, под которым скрывается Йоханнес Бруфельдт.
# Дополнительно необходимо вывести область интересов указанной личности, место рождения,
# годы рождения и смерти (если человек умер), вычислить возраст на данный момент (или момент смерти).
# Для хранения всех необходимых данных требуется использовать переменные.
# После вывода информации программа должна дожидаться пока пользователь нажмет Enter для выхода.

# Пяткин Павел Юрьевич
# 12.03.2017

interest= 'Юхани Ахо - финский писатель, журналист, переводчик'
print('Йоханнес Бруфельдт более известен, как ', interest)
PlaceOfBirth='Лапинлахти, Финляндия'
print('Место рождения: ', PlaceOfBirth)
YearOfBirth=1861
print('Год рождения: ', YearOfBirth)
YearOfDeath=1921
Age=2017-YearOfDeath
print('Возраст: ', Age)
input ('Нажмите Enter для выхода')