# Задача 1. Вариант 11

# Напишите программу, которая будет сообщать род деятельности и псевдоним под которым скрывается Алессандро Филипели.
# После вывода информации программа должна дожидаться пока пользователь нажмет Enter для выхода.

# Пяткин Павел Юрьевич
# 05.03.2017

print ("Алессандро Филипели известен более, как великий итальянский живописец эпохи Возрождения Сандро Боттичелли ")
input("\n\nНажмите Enter, чтобы выйти.")