# Задача 2. Вариант 11

# Напишите программу, которая будет выводить на экран наиболее понравившееся вам высказывание,
# автором которого является О. Генри.
# Не забудьте о том, что автор должен быть упомянут на отдельной строке.

# Пяткин Павел Юрьевич
# 05.03.2017

print ("Тот не даст себя в обиду в этом мире, кто умеет разбираться в женских фокусах и увертках.")
print ("\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tО`Генри")
input("\n\nНажмите Enter, чтобы выйти.")