# Задача 5. Вариант 11

# Напишите программу, которая бы при запуске случайным образом отображала имя одного из девяти оленей Санта Клауса.

# Пяткин Павел Юрьевич
# 12.03.2017

import random
TheNamesOfSantaClausDeer=['Дэшер', 'Дэнсер', 'Прэнсер', 'Виксен', 'Комет', 'Кьюпид', 'Дондер', 'Блитцен', 'Рудольф']
print(random.choice(TheNamesOfSantaClausDeer))
input('Нажмите Enter')