#	Задача	1.	Вариант	17
#	Напишите	программу,	которая	будет	сообщать	род	деятельности	и	псевдоним	под которым	скрывается	Алексей	Максимович	Пешков.	После	вывода	информации программа	должна	дожидаться	пока	пользователь	нажмет	Enter	для	выхода.
#	Tarasow	A.	V. #	01.04.2017

print("Алексей	Максимович Пешков более известен, как писатель и публицист	Максим Горький.")
input("\n\nНажмите	Enter	для	выхода.")
