#	Задача	1.	Вариант	17
#	Haпишите	программу,	которая	будет	выводить	на	экран	наиболее	понравившееся вам	высказывание,	автором	которого	является	Ас-Cамарканди.	Не	забудьте	о	том, что	автор	должен	быть	упомянут	на	отдельной	строке.
#	Tarasow	A.	V. #	01.04.2017

print("\n Основы каждого государства и фундамент любой страны \n покоятся на справедливости и правосудии.")
print("		Ас-Самарканди")
input("\n\n\n\nНажмите	Enter	для	выхода.")
