#Задача 1. Вариант 3.
#Напишите программу, которая будет сообщать род деятельности и псевдоним под которым скрывается Вильгельм Аполлинарий Костровицкий. После вывода информации программа должна дожидаться пока пользователь нажмет Enter для выхода.
#Deryushkina A.B.
#01.03.2017

print("Вильгельм Аполлинарий Костровицкий более известен, как французский поэт")
input("\n\nНажмите enter для выхода.") 