#Задача 3. Вариант 3.
#Напишите программу, которая выводит имя "Чарльз Лютвидж Доджсон", и запрашивает его псевдоним. Программа должна сцеплять две эти строки и выводить полученную строку, разделяя имя и псевдоним с помощью тире.
#Deryushkina A.B.
#01.03.2017

print("Герой нашей сегодняшней программы - Чарльз Лютвидж Доджсон")
name=input("Под каким же именем мы знаем этого человека? Ваш ответ: ")
#Его псевдоним Льюис Кэрролл
print("Всё верно: Чальз Лютвидж Доджсон", "-", name)
input('\n\nНажмите enter для выхода')