#Задача 4. Вариант 3.
#Напишите программу, которая выводит имя, под которым скрывается Алессандро Филипели. Дополнительно необходимо вывести область интересов указанной личности, место рождения, годы рождения и смерти (если человек умер), вычислить возраст на данный момент (или момент смерти). Для хранения всех необходимых данных требуется использовать переменные. После вывода информации программа должна дожидаться пока пользователь нажмет Enter для выхода.
#Deryushkina A.B.
#15.03.2017

print("Алессандро Филипепи более известен, как живописец Сандро Боттичелли")
print("Место рождения: Флоренция, Италия")
a=1510
b=1445
s=a-b
print("Год рождения: ", b, "Год смерти: ", a)
print("Умер в возрасте:", s , "лет")
input('\n\nНажмите enter для выхода')