#Задача 2. Вариант 3.
#Напишите программу, которая будет выводить на экран наиболее понравившееся вам высказывание, автором которого является Нострадамус. Не забудьте о том, что автор должен быть упомянут на отдельной строке.
#Deryushkina A.B.
#01.03.2017

print("Жизнь - это череда выборов")
print ("\n\t\t\t\t\t\t\t\tНострадамус")
input('\n\nНажмите enter для выхода')