#Задача 4. Вариант 5.
#Напишите программу, которая выводит имя, под которым скрывается Фредерик Аустерлиц. Дополнительно необходимо вывести область интересов указанной личности, место рождения, годы рождения и смерти (если человек умер), вычислить возраст на данный момент (или момент смерти). Для хранения всех необходимых данных требуется использовать переменные. После вывода информации программа должна дожидаться пока пользователь нажмет Enter для выхода.

#Bobykina D.A.
#14.03.2017
print ("Фредерик Аустерлиц")
interes= "актёр, танцор, хореограф, певец, звезда Голливуда"
print("Область интересов:",interes)
dr= "10 мая 1899"
print("Дата рождения:", dr)
umer= "22 июня 1987"
print("Дата смерти:", umer)
gorod= "Омаха, Небраска, США"
print( "Место рождения:", gorod)
let= "88 лет"
print("Умер в возрасте", let)
input("\n\nНажмите Enter чтобы выйти")



