#Задача 1. Вариант 5.
#Напишите программу, которая будет сообщать род деятельности и псевдоним под которым скрывается Анна Андреевна Горенко. После вывода информации программа должна дожидаться пока пользователь нажмет Enter для выхода.

#Bobykina D.A.
#14.03.2017
print("Анна Андреевна Горенко - поэтесса,больше известна,как Анна Ахматова")
input ("\nНажмите Enter для выхода")

