#Задача 3. Вариант 5
#Напишите программу, которая выводит имя "Жан Батист Поклен", и запрашивает его псевдоним. Программа должна сцеплять две эти строки и выводить полученную строку, разделяя имя и псевдоним с помощью тире.

#Bobykina D.A.
#14.03.2017
print ("Жан Батист Поклен")
name= input ("Введите его псевдоним")
print ("Жан Батист Поклен -" + name)
input("\nНажмите Enter чтобы выйти")
#Мольер - псевдоним


