#Задача 2. Вариант 5.
#Напишите программу, которая будет выводить на экран наиболее понравившееся вам высказывание, автором которого является Сюнь-цзы. Не забудьте о том, что автор должен быть упомянут на отдельной строке.

#Bobykina D.A.
#14.03.2017
print ("'Готовность пожертвовать собой ради выполнения долга есть основа поддержания жизни.'")
print ("                                                  Сунь Цзы")
input (" Нажмите Enter чтобы выйти")
