# Задача 1. Вариант 9.
# Напишите программу, которая будет сообщать род деятельности и псевдоним под которым скрывается Борис Николаевич Бугаев. После вывода информации программа должна дожидаться пока пользователь нажмет Enter для выхода

# Lungu R.U.
# 11.04.2017

print("Борис Николаевич Бугаев более известен, как русский писатель Александр Белый.")

input("\n\nНажмите Enter для выхода.")
