# Задача 2. Вариант 11.
# Напишите программу, которая будет выводить на экран наиболее понравившееся вам высказывание, автором которого является О. Генри. Не забудьте о том, что автор должен быть упомянут на отдельной строке.

# Lishutina O. A.
# 15.03.2017

print("Деньги - просто мусор по сравнению с истинной любовью")
print("\t\t\t\t\t\t\t\t\t\t\t\tО. Генри\n")

input("Нажмите enter чтобы выйти.")