#Задание 1. Вариант 11.
#Напишите программу, которая будет сообщать род деятельности и псевдоним под которым скрывается Алессандро Филипели. После вывода информации программа должна дожидаться пока пользователь нажмет Enter для выхода.

#Lishutina O. A.
#15.03.2017

print("Алессандро Филипели великий итальянский живописец более известен, как Сандро Боттичелли.\n ")

input("Нажмите enter чтобы выйти")