#-*- coding: cp1251-*-
# Задача 4 Вариант 7
# Напишите	программу,	которая	выводит	имя,	под	которым	скрывается	Мария	Луиза Чеччарелли.	Дополнительно	необходимо	вывести	область	интересов	указанной личности,	место	рождения,	годы	рождения	и	смерти	(если	человек	умер), вычислить	возраст	на	данный	момент	(или	момент	смерти).	Для	хранения	всех необходимых	данных	требуется	использовать	переменные.	После	вывода информации	программа	должна	дожидаться	пока	пользователь	нажмет	Enter	для выхода.
# Kochetkova I.A
# 04.04.2017
name=("Мария Луиза Чеччарелли - наиболее известная, как итальянская актриса Моника Витти")
place=("Место рождения: Рим, Италия ")
year=("Год рождения: 1931")
age=("Возраст на настоящий момент: 85 лет")
hobby=("Область интересов: актерское мастерство, сценарное искусство и режессура")

print(name)
print(place)
print(year)
print(age)
print(hobby)
input("\n\nНажмите ентер")