#-*-coding: cp1251-*-
# Задача 3 Вариант 7
# Напишите	программу,	которая	выводит	имя	"Мэри	Анн	Эванс",	и	запрашивает	его псевдоним.	Программа	должна	сцеплять	две	эти	строки	и	выводить	полученную строку,	разделяя	имя	и	псевдоним	с	помощью	тире.
# Kochetkova I.A
# 04.04.2017
a="Мэри Анн Эванс"
print("Героиня нашей сегодняшней программы -" ,a)
b=input("\nНапишите ее псевдоним (подсказка, её звали Джордж Элиот) \n")
print(a, "-" , b)
print("\n\nНажмите ентер для продолжения")